In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('employees.csv')
df.head()

   emp_id       emp_name     salary   department joining_date
0       1    Alice Smith  152345.23  Engineering   2014-03-25
1       2      Bob Jones   40211.77      Finance   2011-11-09
2       3  Charlie Brown  115320.55        Sales   2017-06-17
3       4      David Lee    98210.1           HR   2012-08-03
4       5      Eve Patel    73455.9      Support   2019-12-19